app/controllers/feelings_controller.rb

SELECT "feelings".* FROM "feelings"
---
  def index
    @feelings = Feeling.all

INSERT INTO "feelings" ("mood", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["mood", "Productive"], ["created_at", "2015-06-02 21:30:45.960799"], ["updated_at", "2015-06-02 21:30:45.960799"]]
---
  def create
    @feeling = Feeling.new(feeling_params)

    respond_to do |format|
      if @feeling.save

SELECT  "feelings".* FROM "feelings" WHERE "feelings"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_feeling
      @feeling = Feeling.find(params[:id])